fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ДанныеГрафика</schedule>
  <scheduleValue>InformationRegister.ВКМ_ДанныеГрафика.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ДанныеГрафика.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>РезультатОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатПроцента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПоказательОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПроцента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ПремияПроцентом</name>
      <description>Премия процентом</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	// 1. Формируем движение
 СформироватьДвижение();

    // 2. Рассчитать оклад
  
  РассчитатьОклад();
	// регистр ВКМ_Удержания
//	Движения.ВКМ_Удержания.Записывать = Истина;
//	Для Каждого ТекСтрокаНачислениеОклада из НачислениеОклада Цикл
//		Движение = Движения.ВКМ_Удержания.Добавить();
//		Движение.Сторно = Ложь;
//		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
//		Движение.ПериодРегистрации = Дата;
//		Движение.Сотрудник = ТекСтрокаНачислениеОклада.Сотрудник;
//	КонецЦикла;

КонецПроцедуры
// 1. Формируем движение
//СформироватьДвижение();
// 2. Рассчитать оклад

// 3. Рассчитать процент

// 4. Рассчитать отпуск



Процедура СформироватьДвижение()
	
	// 1.1. Сформировать движение по окладу
	СформироватьДвижениеПоОкладу();
	// 1.2. Сформировать движение по проценту
	СформироватьДвижениеПоПроценту();
	// 1.3. Сформировать движение по отпуску
	СформироватьДвижениеПоОтпуску();
	// 1.4. Записать движение
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры


Процедура СформироватьДвижениеПоОкладу()
	
	Фильтр = Новый Структура;
	Фильтр.Вставаить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	НайденныеСтроки = ОсновныеНачисления.НайтиСтроки(Фильтр);
	
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.ОсновныеНачисления КАК ВКМ_НачисленияЗарплатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета = &Оклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник Как Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад
		|ПОМЕСТИТЬ ВТ_ПроцентНачисления
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В
		|		(ВЫБРАТЬ
		|			ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
		|		ИЗ
		|			ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Сотрудник Как Сотрудник,
		|	ВТ_ДанныеДокумента.ВидРасчета,
		|	ВТ_ДанныеДокумента.ДатаНачала Как ПериодДействияНачало,
		|	ВТ_ДанныеДокумента.ДатаОкончания Как ПериодДействияКонец,
		|	ВТ_ПроцентНачисления.Оклад Как ПоказательОклада
		|ИЗ
		|	ВТ_ПроцентНачисления КАК ВТ_ПроцентНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ПроцентНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
			//Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Выборка.ПериодДействияНачало;
		Движение.ПериодДействияКонец = Выборка.ПериодДействияКонец;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ПоказательОклада = Выборка.ПоказательОклада;
		
	КонецЦикла;
		
КонецПроцедуры


Процедура СформироватьДвижениеПоПроценту()

Фильтр = Новый Структура;
	Фильтр.Вставаить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом);
	
	ПремияПроцентом = ОсновныеНачисления.НайтиСтроки(Фильтр);
	
	Если Не ЗначениеЗаполнено(ПремияПроцентом) Тогда
		Возврат;
	КонецЕсли;	
	
Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.ОсновныеНачисления КАК ВКМ_НачисленияЗарплатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета = &Оклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник Как Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПоказательПроцента
		|ПОМЕСТИТЬ ВТ_ПроцентНачисления
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В
		|		(ВЫБРАТЬ
		|			ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
		|		ИЗ
		|			ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Сотрудник Как Сотрудник,
		|	ВТ_ДанныеДокумента.ВидРасчета,
		|	ВТ_ДанныеДокумента.ДатаНачала Как ПериодДействияНачало,
		|	ВТ_ДанныеДокумента.ДатаОкончания Как ПериодДействияКонец,
		|	ВТ_ПроцентНачисления.ПоказательПроцента Как ПоказательПроцента
		|ИЗ
		|	ВТ_ПроцентНачисления КАК ВТ_ПроцентНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ПроцентНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПремияПроцентом;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Выборка.ПериодДействияНачало;
		Движение.ПериодДействияКонец = Выборка.ПериодДействияКонец;
		//Движение.ПериодДействияКонец = Выборка.ПериодДействияКонец;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ПоказательПроцента = Выборка.ПоказательПроцента;
		
	КонецЦикла;	
	
КонецПроцедуры


Процедура СформироватьДвижениеПоОтпуску()

Фильтр = Новый Структура;
	Фильтр.Вставаить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	НачислениеОтпуска= ОсновныеНачисления.НайтиСтроки(Фильтр);
	
	Если Не ЗначениеЗаполнено(НачислениеОтпуска) Тогда
		Возврат;
	КонецЕсли;	
	
		// регистр ВКМ_ОсновныеНачисления
	//Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
Для Каждого СтрокаНачислениеОтпуска Из НачислениеОтпуска Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		
		//Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		Движение.ВидРасчета = СтрокаНачислениеОтпуска.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = СтрокаНачислениеОтпуска.ДатаНачала;
		Движение.ПериодДействияКонец = СтрокаНачислениеОтпуска.ДатаОкончания;
		Движение.Сотрудник = СтрокаНачислениеОтпуска.Сотрудник;
		
		//Отпускные рассчитываются из расчёта среднедневной заработной платы за последние 12 месяцев:
		//Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(СтрокаНачислениеПроцента.ДатаНачала, -13));
		//Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(СтрокаНачислениеПроцента.ДатаНачала, -1));  
КонецЦикла;

КонецПроцедуры


 Процедура РассчитатьОклад()
 
 	
 КонецПроцедуры
